---
kind: property
id: P:Autodesk.Revit.DB.ElementPhaseStatusFilter.PhaseId
source: html/d85cff23-7fd8-b5ec-343c-b6cc069e430a.htm
---
# Autodesk.Revit.DB.ElementPhaseStatusFilter.PhaseId Property

The phase id.

## Syntax (C#)
```csharp
public ElementId PhaseId { get; }
```